In [2]:
import pandas as pd
import numpy as np
import datetime as dt

In [28]:
xls = pd.ExcelFile('KPMG_VI_New_raw_data_update_final.xlsx')
cd = pd.read_excel(xls, 'CustomerDemographic', header=0)

C:\Users\kamal\AppData\Local\Temp\ipykernel_3028\1705722397.py:2: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  cd = pd.read_excel(xls, 'CustomerDemographic', header=0)

# CustomerDemographic datasets

In [29]:
cd.columns

Index(['customer_id', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'default', 'owns_car', 'tenure'],
      dtype='object')

In [30]:
cd = cd[['customer_id',  'gender','DOB',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car']]

In [31]:
cd.head()

,customer_id,gender,DOB,job_industry_category,wealth_segment,deceased_indicator,owns_car
0,1,F,1953-10-12,Health,Mass Customer,N,Yes
1,2,Male,1980-12-16,Financial Services,Mass Customer,N,Yes
2,3,Male,1954-01-20,Property,Mass Customer,N,Yes
3,4,Male,1961-10-03,IT,Mass Customer,N,No
4,5,Female,1977-05-13,NaN,Affluent Customer,N,Yes

In [32]:
cd.isnull().sum()

customer_id                0
gender                     0
DOB                       87
job_industry_category    656
wealth_segment             0
deceased_indicator         0
owns_car                   0
dtype: int64

In [33]:
cd.shape

(4000, 7)

In [34]:
cd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   customer_id            4000 non-null   int64
 1   gender                 4000 non-null   object
 2   DOB                    3913 non-null   datetime64[ns]
 3   job_industry_category  3344 non-null   object
 4   wealth_segment         4000 non-null   object
 5   deceased_indicator     4000 non-null   object
 6   owns_car               4000 non-null   object
dtypes: datetime64[ns](1), int64(1), object(5)
memory usage: 218.9+ KB

In [35]:
pd.to_datetime(cd['DOB'])

0      1953-10-12
1      1980-12-16
2      1954-01-20
3      1961-10-03
4      1977-05-13
          ...
3995   1975-08-09
3996   2001-07-13
3997          NaT
3998   1973-10-24
3999   1991-11-05
Name: DOB, Length: 4000, dtype: datetime64[ns]

In [36]:
cd['cus_age'] = cd['DOB'].dt.year

In [38]:
cd[cd['cus_age'] == 'F']

Empty DataFrame
Columns: [customer_id, gender, DOB, job_industry_category, wealth_segment, deceased_indicator, owns_car, cus_age]
Index: []

In [50]:
cd['DOB'].dtype

dtype('<M8[ns]')

In [51]:
cd

,customer_id,gender,DOB,job_industry_category,wealth_segment,deceased_indicator,owns_car,cus_age
0,1,F,1953-10-12,Health,Mass Customer,N,Yes,1953.0
1,2,Male,1980-12-16,Financial Services,Mass Customer,N,Yes,1980.0
2,3,Male,1954-01-20,Property,Mass Customer,N,Yes,1954.0
3,4,Male,1961-10-03,IT,Mass Customer,N,No,1961.0
4,5,Female,1977-05-13,NaN,Affluent Customer,N,Yes,1977.0
...,...,...,...,...,...,...,...,...
3995,3996,Female,1975-08-09,Health,Mass Customer,N,No,1975.0
3996,3997,Female,2001-07-13,Manufacturing,High Net Worth,N,Yes,2001.0
3997,3998,U,NaT,IT,High Net Worth,N,No,NaN
3998,3999,Male,1973-10-24,Manufacturing,Affluent Customer,N,Yes,1973.0
3999,4000,Male,1991-11-05,NaN,Affluent Customer,N,No,1991.0

In [52]:
cd['current_year'] = dt.datetime.now()

In [54]:
cd['year']= cd['current_year'].dt.year

In [58]:
cd['customer_current_age'] = cd['year'] - cd['cus_age']

In [59]:
cd['customer_current_age']

0       70.0
1       43.0
2       69.0
3       62.0
4       46.0
        ...
3995    48.0
3996    22.0
3997     NaN
3998    50.0
3999    32.0
Name: customer_current_age, Length: 4000, dtype: float64

In [61]:
cd.columns

Index(['customer_id', 'gender', 'DOB', 'job_industry_category',
       'wealth_segment', 'deceased_indicator', 'owns_car', 'cus_age',
       'current_year', 'year', 'customer_current_age'],
      dtype='object')

In [62]:
import random
rd = random.choice(['Manufacturing', 'Financial Services'])
rd

'Manufacturing'

In [63]:
cd.gender.value_counts()

Female    2037
Male      1872
U           88
F            1
Femal        1
M            1
Name: gender, dtype: int64

In [64]:
cd.gender.replace('F', 'Female', inplace=True)
cd.gender.replace('M', 'Male', inplace=True)
cd.gender.replace('Femal', 'Female', inplace=True)

In [65]:
cd.gender.mode()

0    Female
Name: gender, dtype: object

In [66]:
# here u is unknown value so i replaced by the most frequent value
cd.gender.replace('U', 'Female', inplace=True)

In [67]:
cd.gender.value_counts()

Female    2127
Male      1873
Name: gender, dtype: int64

In [68]:
cd.columns

Index(['customer_id', 'gender', 'DOB', 'job_industry_category',
       'wealth_segment', 'deceased_indicator', 'owns_car', 'cus_age',
       'current_year', 'year', 'customer_current_age'],
      dtype='object')

In [69]:
cd['job_industry_category'].value_counts()

Manufacturing         799
Financial Services    774
Health                602
Retail                358
Property              267
IT                    223
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64

In [70]:
cd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 11 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   customer_id            4000 non-null   int64
 1   gender                 4000 non-null   object
 2   DOB                    3913 non-null   datetime64[ns]
 3   job_industry_category  3344 non-null   object
 4   wealth_segment         4000 non-null   object
 5   deceased_indicator     4000 non-null   object
 6   owns_car               4000 non-null   object
 7   cus_age                3913 non-null   float64
 8   current_year           4000 non-null   datetime64[ns]
 9   year                   4000 non-null   int64
 10  customer_current_age   3913 non-null   float64
dtypes: datetime64[ns](2), float64(2), int64(2), object(5)
memory usage: 343.9+ KB

In [74]:
cd.columns

Index(['customer_id', 'gender', 'DOB', 'job_industry_category',
       'wealth_segment', 'deceased_indicator', 'owns_car', 'cus_age',
       'current_year', 'year', 'customer_current_age'],
      dtype='object')

In [76]:
cd = cd[['customer_id', 'gender', 'job_industry_category',
       'wealth_segment', 'deceased_indicator', 'owns_car','customer_current_age']]

In [78]:
cd.isnull().sum()/len(cd)*100

customer_id               0.000
gender                    0.000
job_industry_category    16.400
wealth_segment            0.000
deceased_indicator        0.000
owns_car                  0.000
customer_current_age      2.175
dtype: float64

In [80]:
cd['job_industry_category'].value_counts()

Manufacturing         799
Financial Services    774
Health                602
Retail                358
Property              267
IT                    223
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64

In [81]:
# job_industry_category has 16% data is missing so we can't drop it we will fill using any method

In [82]:
import random
# I have taken most frequent value here these two value are too near so i taken both to fill th null value
rd = random.choice(['Manufacturing', 'Financial Services'])
rd

'Financial Services'

In [83]:
cd.fillna(rd, inplace=True)

C:\Users\kamal\AppData\Local\Temp\ipykernel_3028\1187085163.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cd.fillna(rd, inplace=True)

In [84]:
cd.isnull().sum()

customer_id              0
gender                   0
job_industry_category    0
wealth_segment           0
deceased_indicator       0
owns_car                 0
customer_current_age     0
dtype: int64

In [85]:
cd.head()

,customer_id,gender,job_industry_category,wealth_segment,deceased_indicator,owns_car,customer_current_age
0,1,Female,Health,Mass Customer,N,Yes,70.0
1,2,Male,Financial Services,Mass Customer,N,Yes,43.0
2,3,Male,Property,Mass Customer,N,Yes,69.0
3,4,Male,IT,Mass Customer,N,No,62.0
4,5,Female,Financial Services,Affluent Customer,N,Yes,46.0

In [86]:
cd.shape

(4000, 7)

In [88]:
cd.to_excel('train_CustomerDemographic.xlsx', index=None)

# CustomerAddress Datasets

In [15]:
ca = pd.read_excel(xls, 'CustomerAddress', header = 1)

In [16]:
ca.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [17]:
ca.columns

Index(['customer_id', 'address', 'postcode', 'state', 'country',
       'property_valuation'],
      dtype='object')

In [18]:
ca = ca[['customer_id', 'address', 'state', 'country']]

In [19]:
ca.isnull().sum()

customer_id    0
address        0
state          0
country        0
dtype: int64

In [20]:
ca.head()

   customer_id              address            state    country
0            1   060 Morning Avenue  New South Wales  Australia
1            2  6 Meadow Vale Court  New South Wales  Australia
2            4   0 Holy Cross Court              QLD  Australia
3            5  17979 Del Mar Point  New South Wales  Australia
4            6     9 Oakridge Court              VIC  Australia

In [24]:
ca.state.value_counts()

NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
Name: state, dtype: int64

In [25]:
# Here VIC and Victoria is the same value so i will peplace by Victoria to VIC
# Same NSW is the same for New South Wales so i will peplace by New South Wales to NSW

In [29]:
ca['state'].replace('New South Wales', 'NSW', inplace=True)
ca['state'].replace('Victoria', 'VIC', inplace=True)

In [30]:
ca.state.value_counts()

NSW    2140
VIC    1021
QLD     838
Name: state, dtype: int64

In [33]:
ca.to_excel('train_CustomerAddress.xlsx', index=None)

# Transaction datasets

In [ ]:
trans = pd.read_excel(xls, 'Transactions', header=1)

In [ ]:
trans.shape

In [ ]:
trans.isnull().sum()/len(trans)*100

In [ ]:
trans.dropna(inplace=True)

In [ ]:
trans.isnull().sum()

In [ ]:
trans.columns

In [ ]:
trans = trans[['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'online_order', 'order_status', 'brand', 'product_line',
       'product_class', 'product_size', 'list_price', 'standard_cost']]

In [ ]:
trans.info()

In [ ]:
import datetime as dt

In [ ]:
trans['transactions_month'] = trans['transaction_date'].dt.month_name()

In [ ]:
trans.head()

In [ ]:
trans.columns

In [ ]:
trans = trans[['transaction_id', 'product_id', 'customer_id',
       'online_order', 'order_status', 'brand', 'product_line',
       'product_class', 'product_size', 'list_price', 'standard_cost',
       'transactions_month']]

In [ ]:
trans.to_excel('train_transaction.xlsx', index=None)